# EndsWithRiser Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..EndsWithRiser Property
StairsRun Class See Also
---
True if the stairs run ends with a riser, false otherwise.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool EndsWithRiser { get; set; }
```

Visual Basic
---
```text
Public Property EndsWithRiser As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EndsWithRiser {
	bool get ();
	void set (bool value);
}
```

# Remarks
If selected, Revit adds a riser to the end of the run. Clearing this option will change the number of risers in the run. You will need to manually add or remove risers to maintain the original height.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace